# 数据探索

In [2]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

In [16]:
data_path="../data/train.csv"
data=pd.read_csv(data_path)
data.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [18]:
survived_data=data[data['Survived']==1]
survived_data.head(10)

    PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1             2         1       1  ...  71.2833   C85         C
2             3         1       3  ...   7.9250   NaN         S
3             4         1       1  ...  53.1000  C123         S
8             9         1       3  ...  11.1333   NaN         S
9            10         1       2  ...  30.0708   NaN         C
10           11         1       3  ...  16.7000    G6         S
11           12         1       1  ...  26.5500  C103         S
15           16         1       2  ...  16.0000   NaN         S
17           18         1       2  ...  13.0000   NaN         S
19           20         1       3  ...   7.2250   NaN         C

[10 rows x 12 columns]

## 1、尝试从性别分析

In [26]:
male_data=data[data['Sex']=='male']
female_data=data[data['Sex']=='female']
male_survived_rate=len(male_data[male_data['Survived']==1])/len(male_data)
female_survived_rate=len(female_data[female_data['Survived']==1])/len(female_data)
print("男性：",male_survived_rate,'\n')
print("女性：",female_survived_rate)

男性： 0.18890814558058924

女性： 0.7420382165605095

结论：女性生存率远高于男性，因此性别是重要特征

## 2、从登船地分析

In [29]:
in_C= data[data['Embarked']=='C']
in_Q= data[data['Embarked']=='Q']
in_S= data[data['Embarked']=='S']
C_survived_rate=len(in_C[in_C['Survived']==1])/len(in_C)
Q_survived_rate=len(in_Q[in_Q['Survived']==1])/len(in_Q)
S_survived_rate=len(in_S[in_S['Survived']==1])/len(in_S)
print("C登船生存率：",C_survived_rate)
print("Q登船生存率：",Q_survived_rate)  
print("S登船生存率：",S_survived_rate)

C登船生存率： 0.5535714285714286
Q登船生存率： 0.38961038961038963
S登船生存率： 0.33695652173913043

结论：c点生存率显著偏高，而q点略高于s点，差别不大。可以作为特征